---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.ReinforcementLength
source: html/a1d6f28b-d607-a3b6-cfa4-59cc9a905c0a.htm
---
# Autodesk.Revit.DB.SpecTypeId.ReinforcementLength Property

Reinforcement Length, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId ReinforcementLength { get; }
```